<?xml version="1.0"?>
<CastXML format="1.1.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9"/>
  <Typedef id="_2" name="__int128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_7" name="nfds_t" type="_15" context="_1" location="f1:33" file="f1" line="33"/>
  <Struct id="_8" name="pollfd" context="_1" location="f1:36" file="f1" line="36" members="_16 _17 _18" size="64" align="32"/>
  <Function id="_9" name="poll" returns="_19" context="_1" location="f1:54" file="f1" line="54" extern="1" mangled="_Z4poll">
    <Argument name="__fds" type="_20" location="f1:54" file="f1" line="54"/>
    <Argument name="__nfds" type="_7" location="f1:54" file="f1" line="54"/>
    <Argument name="__timeout" type="_19" location="f1:54" file="f1" line="54"/>
  </Function>
  <FundamentalType id="_10" name="__int128" size="128" align="128"/>
  <FundamentalType id="_11" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_12" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_21 _22 _23 _24" size="256" align="64"/>
  <PointerType id="_13" type="_25" size="64" align="64"/>
  <ArrayType id="_14" min="0" max="0" type="_26"/>
  <FundamentalType id="_15" name="long unsigned int" size="64" align="64"/>
  <Field id="_16" name="fd" type="_19" context="_8" access="public" location="f1:38" file="f1" line="38" offset="0"/>
  <Field id="_17" name="events" type="_27" context="_8" access="public" location="f1:39" file="f1" line="39" offset="32"/>
  <Field id="_18" name="revents" type="_27" context="_8" access="public" location="f1:40" file="f1" line="40" offset="48"/>
  <FundamentalType id="_19" name="int" size="32" align="32"/>
  <PointerType id="_20" type="_28" size="64" align="64"/>
  <Field id="_21" name="isa" type="_29" context="_12" access="public" offset="0"/>
  <Field id="_22" name="flags" type="_19" context="_12" access="public" offset="64"/>
  <Field id="_23" name="str" type="_30" context="_12" access="public" offset="128"/>
  <Field id="_24" name="length" type="_31" context="_12" access="public" offset="192"/>
  <Struct id="_26" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_32 _33 _34 _35" size="192" align="64"/>
  <FundamentalType id="_27" name="short int" size="16" align="16"/>
  <PointerType id="_29" type="_19c" size="64" align="64"/>
  <CvQualifiedType id="_19c" type="_19" const="1"/>
  <PointerType id="_30" type="_25c" size="64" align="64"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <FundamentalType id="_31" name="long int" size="64" align="64"/>
  <Field id="_32" name="gp_offset" type="_36" context="_26" access="public" offset="0"/>
  <Field id="_33" name="fp_offset" type="_36" context="_26" access="public" offset="32"/>
  <Field id="_34" name="overflow_arg_area" type="_37" context="_26" access="public" offset="64"/>
  <Field id="_35" name="reg_save_area" type="_37" context="_26" access="public" offset="128"/>
  <FundamentalType id="_36" name="unsigned int" size="32" align="32"/>
  <PointerType id="_37" type="_38" size="64" align="64"/>
  <FundamentalType id="_25" name="char" size="8" align="8"/>
  <ElaboratedType id="_28" type="_8"/>
  <FundamentalType id="_38" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/lib/gcc-cross/arm-linux-gnueabi/8/../../../../arm-linux-gnueabi/include/sys/poll.h"/>
</CastXML>
