<?xml version="1.0"?>
<CastXML format="1.1.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9"/>
  <Typedef id="_2" name="__int128_t" type="_10" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__uint128_t" type="_11" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__NSConstantString" type="_12" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_5" name="__builtin_ms_va_list" type="_13" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_6" name="__builtin_va_list" type="_14" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_7" name="winsize" context="_1" location="f1:26" file="f1" line="26" members="_15 _16 _17 _18" size="64" align="16"/>
  <Struct id="_8" name="termio" context="_1" location="f1:35" file="f1" line="35" members="_19 _20 _21 _22 _23 _24" size="336" align="16"/>
  <Function id="_9" name="ioctl" returns="_25" context="_1" location="f2:41" file="f2" line="41" extern="1" mangled="_Z5ioctl">
    <Argument name="__fd" type="_25" location="f2:41" file="f2" line="41"/>
    <Argument name="__request" type="_26" location="f2:41" file="f2" line="41"/>
    <Ellipsis/>
  </Function>
  <FundamentalType id="_10" name="__int128" size="128" align="128"/>
  <FundamentalType id="_11" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_12" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_27 _28 _29 _30" size="256" align="64"/>
  <PointerType id="_13" type="_31" size="64" align="64"/>
  <ArrayType id="_14" min="0" max="0" type="_32"/>
  <Field id="_15" name="ws_row" type="_33" context="_7" access="public" location="f1:28" file="f1" line="28" offset="0"/>
  <Field id="_16" name="ws_col" type="_33" context="_7" access="public" location="f1:29" file="f1" line="29" offset="16"/>
  <Field id="_17" name="ws_xpixel" type="_33" context="_7" access="public" location="f1:30" file="f1" line="30" offset="32"/>
  <Field id="_18" name="ws_ypixel" type="_33" context="_7" access="public" location="f1:31" file="f1" line="31" offset="48"/>
  <Field id="_19" name="c_iflag" type="_33" context="_8" access="public" location="f1:37" file="f1" line="37" offset="0"/>
  <Field id="_20" name="c_oflag" type="_33" context="_8" access="public" location="f1:38" file="f1" line="38" offset="16"/>
  <Field id="_21" name="c_cflag" type="_33" context="_8" access="public" location="f1:39" file="f1" line="39" offset="32"/>
  <Field id="_22" name="c_lflag" type="_33" context="_8" access="public" location="f1:40" file="f1" line="40" offset="48"/>
  <Field id="_23" name="c_line" type="_31" context="_8" access="public" location="f1:41" file="f1" line="41" offset="64"/>
  <Field id="_24" name="c_cc" type="_34" context="_8" access="public" location="f1:43" file="f1" line="43" offset="72"/>
  <FundamentalType id="_25" name="int" size="32" align="32"/>
  <FundamentalType id="_26" name="long unsigned int" size="64" align="64"/>
  <Field id="_27" name="isa" type="_35" context="_12" access="public" offset="0"/>
  <Field id="_28" name="flags" type="_25" context="_12" access="public" offset="64"/>
  <Field id="_29" name="str" type="_36" context="_12" access="public" offset="128"/>
  <Field id="_30" name="length" type="_37" context="_12" access="public" offset="192"/>
  <FundamentalType id="_31" name="char" size="8" align="8"/>
  <Struct id="_32" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_38 _39 _40 _41" size="192" align="64"/>
  <FundamentalType id="_33" name="short unsigned int" size="16" align="16"/>
  <ArrayType id="_34" min="0" max="31" type="_42"/>
  <PointerType id="_35" type="_25c" size="64" align="64"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <PointerType id="_36" type="_31c" size="64" align="64"/>
  <CvQualifiedType id="_31c" type="_31" const="1"/>
  <FundamentalType id="_37" name="long int" size="64" align="64"/>
  <Field id="_38" name="gp_offset" type="_43" context="_32" access="public" offset="0"/>
  <Field id="_39" name="fp_offset" type="_43" context="_32" access="public" offset="32"/>
  <Field id="_40" name="overflow_arg_area" type="_44" context="_32" access="public" offset="64"/>
  <Field id="_41" name="reg_save_area" type="_44" context="_32" access="public" offset="128"/>
  <FundamentalType id="_42" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_43" name="unsigned int" size="32" align="32"/>
  <PointerType id="_44" type="_45" size="64" align="64"/>
  <FundamentalType id="_45" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/lib/gcc-cross/mips64el-linux-gnuabi64/8/../../../../mips64el-linux-gnuabi64/include/bits/ioctl-types.h"/>
  <File id="f2" name="/usr/lib/gcc-cross/mips64el-linux-gnuabi64/8/../../../../mips64el-linux-gnuabi64/include/sys/ioctl.h"/>
</CastXML>
