<?xml version="1.0"?>
<CastXML format="1.1.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6"/>
  <Typedef id="_2" name="__NSConstantString" type="_7" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__builtin_va_list" type="_8" context="_1" location="f0:0" file="f0" line="0"/>
  <Struct id="_4" name="winsize" context="_1" location="f1:27" file="f1" line="27" members="_9 _10 _11 _12" size="64" align="16"/>
  <Struct id="_5" name="termio" context="_1" location="f1:36" file="f1" line="36" members="_13 _14 _15 _16 _17 _18" size="144" align="16"/>
  <Function id="_6" name="ioctl" returns="_19" context="_1" location="f2:41" file="f2" line="41" extern="1" mangled="_Z5ioctl">
    <Argument name="__fd" type="_19" location="f2:41" file="f2" line="41"/>
    <Argument name="__request" type="_20" location="f2:41" file="f2" line="41"/>
    <Ellipsis/>
  </Function>
  <Struct id="_7" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_21 _22 _23 _24" size="128" align="32"/>
  <PointerType id="_8" type="_25" size="32" align="32"/>
  <Field id="_9" name="ws_row" type="_26" context="_4" access="public" location="f1:29" file="f1" line="29" offset="0"/>
  <Field id="_10" name="ws_col" type="_26" context="_4" access="public" location="f1:30" file="f1" line="30" offset="16"/>
  <Field id="_11" name="ws_xpixel" type="_26" context="_4" access="public" location="f1:31" file="f1" line="31" offset="32"/>
  <Field id="_12" name="ws_ypixel" type="_26" context="_4" access="public" location="f1:32" file="f1" line="32" offset="48"/>
  <Field id="_13" name="c_iflag" type="_26" context="_5" access="public" location="f1:38" file="f1" line="38" offset="0"/>
  <Field id="_14" name="c_oflag" type="_26" context="_5" access="public" location="f1:39" file="f1" line="39" offset="16"/>
  <Field id="_15" name="c_cflag" type="_26" context="_5" access="public" location="f1:40" file="f1" line="40" offset="32"/>
  <Field id="_16" name="c_lflag" type="_26" context="_5" access="public" location="f1:41" file="f1" line="41" offset="48"/>
  <Field id="_17" name="c_line" type="_27" context="_5" access="public" location="f1:42" file="f1" line="42" offset="64"/>
  <Field id="_18" name="c_cc" type="_28" context="_5" access="public" location="f1:43" file="f1" line="43" offset="72"/>
  <FundamentalType id="_19" name="int" size="32" align="32"/>
  <FundamentalType id="_20" name="long unsigned int" size="32" align="32"/>
  <Field id="_21" name="isa" type="_29" context="_7" access="public" offset="0"/>
  <Field id="_22" name="flags" type="_19" context="_7" access="public" offset="32"/>
  <Field id="_23" name="str" type="_30" context="_7" access="public" offset="64"/>
  <Field id="_24" name="length" type="_31" context="_7" access="public" offset="96"/>
  <FundamentalType id="_26" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_27" name="unsigned char" size="8" align="8"/>
  <ArrayType id="_28" min="0" max="7" type="_27"/>
  <PointerType id="_29" type="_19c" size="32" align="32"/>
  <CvQualifiedType id="_19c" type="_19" const="1"/>
  <PointerType id="_30" type="_25c" size="32" align="32"/>
  <CvQualifiedType id="_25c" type="_25" const="1"/>
  <FundamentalType id="_31" name="long int" size="32" align="32"/>
  <FundamentalType id="_25" name="char" size="8" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/bits/ioctl-types.h"/>
  <File id="f2" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/sys/ioctl.h"/>
</CastXML>
