<?xml version="1.0"?>
<CastXML format="1.1.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71"/>
  <Typedef id="_2" name="__NSConstantString" type="_72" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__builtin_va_list" type="_73" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__u_char" type="_74" context="_1" location="f1:30" file="f1" line="30"/>
  <Typedef id="_5" name="__u_short" type="_75" context="_1" location="f1:31" file="f1" line="31"/>
  <Typedef id="_6" name="__u_int" type="_76" context="_1" location="f1:32" file="f1" line="32"/>
  <Typedef id="_7" name="__u_long" type="_77" context="_1" location="f1:33" file="f1" line="33"/>
  <Typedef id="_8" name="__int8_t" type="_78" context="_1" location="f1:36" file="f1" line="36"/>
  <Typedef id="_9" name="__uint8_t" type="_74" context="_1" location="f1:37" file="f1" line="37"/>
  <Typedef id="_10" name="__int16_t" type="_79" context="_1" location="f1:38" file="f1" line="38"/>
  <Typedef id="_11" name="__uint16_t" type="_75" context="_1" location="f1:39" file="f1" line="39"/>
  <Typedef id="_12" name="__int32_t" type="_80" context="_1" location="f1:40" file="f1" line="40"/>
  <Typedef id="_13" name="__uint32_t" type="_76" context="_1" location="f1:41" file="f1" line="41"/>
  <Typedef id="_14" name="__int64_t" type="_81" context="_1" location="f1:46" file="f1" line="46"/>
  <Typedef id="_15" name="__uint64_t" type="_82" context="_1" location="f1:47" file="f1" line="47"/>
  <Typedef id="_16" name="__quad_t" type="_81" context="_1" location="f1:55" file="f1" line="55"/>
  <Typedef id="_17" name="__u_quad_t" type="_82" context="_1" location="f1:56" file="f1" line="56"/>
  <Typedef id="_18" name="__intmax_t" type="_81" context="_1" location="f1:64" file="f1" line="64"/>
  <Typedef id="_19" name="__uintmax_t" type="_82" context="_1" location="f1:65" file="f1" line="65"/>
  <Typedef id="_20" name="__dev_t" type="_17" context="_1" location="f1:133" file="f1" line="133"/>
  <Typedef id="_21" name="__uid_t" type="_76" context="_1" location="f1:134" file="f1" line="134"/>
  <Typedef id="_22" name="__gid_t" type="_76" context="_1" location="f1:135" file="f1" line="135"/>
  <Typedef id="_23" name="__ino_t" type="_77" context="_1" location="f1:136" file="f1" line="136"/>
  <Typedef id="_24" name="__ino64_t" type="_17" context="_1" location="f1:137" file="f1" line="137"/>
  <Typedef id="_25" name="__mode_t" type="_76" context="_1" location="f1:138" file="f1" line="138"/>
  <Typedef id="_26" name="__nlink_t" type="_76" context="_1" location="f1:139" file="f1" line="139"/>
  <Typedef id="_27" name="__off_t" type="_83" context="_1" location="f1:140" file="f1" line="140"/>
  <Typedef id="_28" name="__off64_t" type="_16" context="_1" location="f1:141" file="f1" line="141"/>
  <Typedef id="_29" name="__pid_t" type="_80" context="_1" location="f1:142" file="f1" line="142"/>
  <Struct id="_30" name="" context="_1" location="f1:143" file="f1" line="143" members="_84" size="64" align="32"/>
  <Typedef id="_31" name="__fsid_t" type="_85" context="_1" location="f1:143" file="f1" line="143"/>
  <Typedef id="_32" name="__clock_t" type="_83" context="_1" location="f1:144" file="f1" line="144"/>
  <Typedef id="_33" name="__rlim_t" type="_77" context="_1" location="f1:145" file="f1" line="145"/>
  <Typedef id="_34" name="__rlim64_t" type="_17" context="_1" location="f1:146" file="f1" line="146"/>
  <Typedef id="_35" name="__id_t" type="_76" context="_1" location="f1:147" file="f1" line="147"/>
  <Typedef id="_36" name="__time_t" type="_83" context="_1" location="f1:148" file="f1" line="148"/>
  <Typedef id="_37" name="__useconds_t" type="_76" context="_1" location="f1:149" file="f1" line="149"/>
  <Typedef id="_38" name="__suseconds_t" type="_83" context="_1" location="f1:150" file="f1" line="150"/>
  <Typedef id="_39" name="__daddr_t" type="_80" context="_1" location="f1:152" file="f1" line="152"/>
  <Typedef id="_40" name="__key_t" type="_80" context="_1" location="f1:153" file="f1" line="153"/>
  <Typedef id="_41" name="__clockid_t" type="_80" context="_1" location="f1:156" file="f1" line="156"/>
  <Typedef id="_42" name="__timer_t" type="_86" context="_1" location="f1:159" file="f1" line="159"/>
  <Typedef id="_43" name="__blksize_t" type="_83" context="_1" location="f1:162" file="f1" line="162"/>
  <Typedef id="_44" name="__blkcnt_t" type="_83" context="_1" location="f1:167" file="f1" line="167"/>
  <Typedef id="_45" name="__blkcnt64_t" type="_16" context="_1" location="f1:168" file="f1" line="168"/>
  <Typedef id="_46" name="__fsblkcnt_t" type="_77" context="_1" location="f1:171" file="f1" line="171"/>
  <Typedef id="_47" name="__fsblkcnt64_t" type="_17" context="_1" location="f1:172" file="f1" line="172"/>
  <Typedef id="_48" name="__fsfilcnt_t" type="_77" context="_1" location="f1:175" file="f1" line="175"/>
  <Typedef id="_49" name="__fsfilcnt64_t" type="_17" context="_1" location="f1:176" file="f1" line="176"/>
  <Typedef id="_50" name="__fsword_t" type="_80" context="_1" location="f1:179" file="f1" line="179"/>
  <Typedef id="_51" name="__ssize_t" type="_80" context="_1" location="f1:181" file="f1" line="181"/>
  <Typedef id="_52" name="__syscall_slong_t" type="_83" context="_1" location="f1:184" file="f1" line="184"/>
  <Typedef id="_53" name="__syscall_ulong_t" type="_77" context="_1" location="f1:186" file="f1" line="186"/>
  <Typedef id="_54" name="__loff_t" type="_28" context="_1" location="f1:190" file="f1" line="190"/>
  <Typedef id="_55" name="__caddr_t" type="_73" context="_1" location="f1:191" file="f1" line="191"/>
  <Typedef id="_56" name="__intptr_t" type="_80" context="_1" location="f1:194" file="f1" line="194"/>
  <Typedef id="_57" name="__socklen_t" type="_76" context="_1" location="f1:197" file="f1" line="197"/>
  <Typedef id="_58" name="__sig_atomic_t" type="_80" context="_1" location="f1:202" file="f1" line="202"/>
  <Struct id="_59" name="flock" context="_1" location="f2:35" file="f2" line="35" members="_87 _88 _89 _90 _91" size="128" align="32"/>
  <Typedef id="_60" name="mode_t" type="_25" context="_1" location="f3:50" file="f3" line="50"/>
  <Typedef id="_61" name="off_t" type="_27" context="_1" location="f3:56" file="f3" line="56"/>
  <Typedef id="_62" name="pid_t" type="_29" context="_1" location="f3:69" file="f3" line="69"/>
  <Struct id="_63" name="timespec" context="_1" location="f4:8" file="f4" line="8" members="_92 _93" size="64" align="32"/>
  <Struct id="_64" name="stat" context="_1" location="f5:46" file="f5" line="46" members="_94 _95 _96 _97 _98 _99 _100 _101 _102 _103 _104 _105 _106 _107 _108 _109 _110" size="704" align="32"/>
  <Function id="_65" name="fcntl" returns="_80" context="_1" location="f3:147" file="f3" line="147" extern="1" mangled="_Z5fcntl">
    <Argument name="__fd" type="_80" location="f3:147" file="f3" line="147"/>
    <Argument name="__cmd" type="_80" location="f3:147" file="f3" line="147"/>
    <Ellipsis/>
  </Function>
  <Function id="_66" name="open" returns="_80" context="_1" location="f3:157" file="f3" line="157" extern="1" mangled="_Z4open">
    <Argument name="__file" type="_111" location="f3:157" file="f3" line="157"/>
    <Argument name="__oflag" type="_80" location="f3:157" file="f3" line="157"/>
    <Ellipsis/>
  </Function>
  <Function id="_67" name="openat" returns="_80" context="_1" location="f3:181" file="f3" line="181" extern="1" mangled="_Z6openat">
    <Argument name="__fd" type="_80" location="f3:181" file="f3" line="181"/>
    <Argument name="__file" type="_111" location="f3:181" file="f3" line="181"/>
    <Argument name="__oflag" type="_80" location="f3:181" file="f3" line="181"/>
    <Ellipsis/>
  </Function>
  <Function id="_68" name="creat" returns="_80" context="_1" location="f3:203" file="f3" line="203" extern="1" mangled="_Z5creat">
    <Argument name="__file" type="_111" location="f3:203" file="f3" line="203"/>
    <Argument name="__mode" type="_60" location="f3:203" file="f3" line="203"/>
  </Function>
  <Function id="_69" name="lockf" returns="_80" context="_1" location="f3:232" file="f3" line="232" extern="1" mangled="_Z5lockf">
    <Argument name="__fd" type="_80" location="f3:232" file="f3" line="232"/>
    <Argument name="__cmd" type="_80" location="f3:232" file="f3" line="232"/>
    <Argument name="__len" type="_61" location="f3:232" file="f3" line="232"/>
  </Function>
  <Function id="_70" name="posix_fadvise" returns="_80" context="_1" location="f3:249" file="f3" line="249" extern="1" mangled="_Z13posix_fadvise">
    <Argument name="__fd" type="_80" location="f3:249" file="f3" line="249"/>
    <Argument name="__offset" type="_61" location="f3:249" file="f3" line="249"/>
    <Argument name="__len" type="_61" location="f3:249" file="f3" line="249"/>
    <Argument name="__advise" type="_80" location="f3:250" file="f3" line="250"/>
  </Function>
  <Function id="_71" name="posix_fallocate" returns="_80" context="_1" location="f3:271" file="f3" line="271" extern="1" mangled="_Z15posix_fallocate">
    <Argument name="__fd" type="_80" location="f3:271" file="f3" line="271"/>
    <Argument name="__offset" type="_61" location="f3:271" file="f3" line="271"/>
    <Argument name="__len" type="_61" location="f3:271" file="f3" line="271"/>
  </Function>
  <Struct id="_72" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_112 _113 _114 _115" size="128" align="32"/>
  <PointerType id="_73" type="_116" size="32" align="32"/>
  <FundamentalType id="_74" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_75" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_76" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_77" name="long unsigned int" size="32" align="32"/>
  <FundamentalType id="_78" name="signed char" size="8" align="8"/>
  <FundamentalType id="_79" name="short int" size="16" align="16"/>
  <FundamentalType id="_80" name="int" size="32" align="32"/>
  <FundamentalType id="_81" name="long long int" size="64" align="32"/>
  <FundamentalType id="_82" name="long long unsigned int" size="64" align="32"/>
  <FundamentalType id="_83" name="long int" size="32" align="32"/>
  <Field id="_84" name="__val" type="_117" context="_30" access="public" location="f1:143" file="f1" line="143" offset="0"/>
  <ElaboratedType id="_85" type="_30"/>
  <PointerType id="_86" type="_118" size="32" align="32"/>
  <Field id="_87" name="l_type" type="_79" context="_59" access="public" location="f2:37" file="f2" line="37" offset="0"/>
  <Field id="_88" name="l_whence" type="_79" context="_59" access="public" location="f2:38" file="f2" line="38" offset="16"/>
  <Field id="_89" name="l_start" type="_27" context="_59" access="public" location="f2:40" file="f2" line="40" offset="32"/>
  <Field id="_90" name="l_len" type="_27" context="_59" access="public" location="f2:41" file="f2" line="41" offset="64"/>
  <Field id="_91" name="l_pid" type="_29" context="_59" access="public" location="f2:46" file="f2" line="46" offset="96"/>
  <Field id="_92" name="tv_sec" type="_36" context="_63" access="public" location="f4:10" file="f4" line="10" offset="0"/>
  <Field id="_93" name="tv_nsec" type="_52" context="_63" access="public" location="f4:11" file="f4" line="11" offset="32"/>
  <Field id="_94" name="st_dev" type="_20" context="_64" access="public" location="f5:48" file="f5" line="48" offset="0"/>
  <Field id="_95" name="__pad1" type="_75" context="_64" access="public" location="f5:50" file="f5" line="50" offset="64"/>
  <Field id="_96" name="st_ino" type="_23" context="_64" access="public" location="f5:53" file="f5" line="53" offset="96"/>
  <Field id="_97" name="st_mode" type="_25" context="_64" access="public" location="f5:58" file="f5" line="58" offset="128"/>
  <Field id="_98" name="st_nlink" type="_26" context="_64" access="public" location="f5:59" file="f5" line="59" offset="160"/>
  <Field id="_99" name="st_uid" type="_21" context="_64" access="public" location="f5:64" file="f5" line="64" offset="192"/>
  <Field id="_100" name="st_gid" type="_22" context="_64" access="public" location="f5:65" file="f5" line="65" offset="224"/>
  <Field id="_101" name="st_rdev" type="_20" context="_64" access="public" location="f5:69" file="f5" line="69" offset="256"/>
  <Field id="_102" name="__pad2" type="_75" context="_64" access="public" location="f5:71" file="f5" line="71" offset="320"/>
  <Field id="_103" name="st_size" type="_27" context="_64" access="public" location="f5:74" file="f5" line="74" offset="352"/>
  <Field id="_104" name="st_blksize" type="_43" context="_64" access="public" location="f5:78" file="f5" line="78" offset="384"/>
  <Field id="_105" name="st_blocks" type="_44" context="_64" access="public" location="f5:80" file="f5" line="80" offset="416"/>
  <Field id="_106" name="st_atim" type="_119" context="_64" access="public" location="f5:91" file="f5" line="91" offset="448"/>
  <Field id="_107" name="st_mtim" type="_119" context="_64" access="public" location="f5:92" file="f5" line="92" offset="512"/>
  <Field id="_108" name="st_ctim" type="_119" context="_64" access="public" location="f5:93" file="f5" line="93" offset="576"/>
  <Field id="_109" name="__glibc_reserved4" type="_77" context="_64" access="public" location="f5:109" file="f5" line="109" offset="640"/>
  <Field id="_110" name="__glibc_reserved5" type="_77" context="_64" access="public" location="f5:110" file="f5" line="110" offset="672"/>
  <PointerType id="_111" type="_116c" size="32" align="32"/>
  <Field id="_112" name="isa" type="_120" context="_72" access="public" offset="0"/>
  <Field id="_113" name="flags" type="_80" context="_72" access="public" offset="32"/>
  <Field id="_114" name="str" type="_111" context="_72" access="public" offset="64"/>
  <Field id="_115" name="length" type="_83" context="_72" access="public" offset="96"/>
  <CvQualifiedType id="_116c" type="_116" const="1"/>
  <ArrayType id="_117" min="0" max="1" type="_80"/>
  <ElaboratedType id="_119" type="_63"/>
  <PointerType id="_120" type="_80c" size="32" align="32"/>
  <CvQualifiedType id="_80c" type="_80" const="1"/>
  <FundamentalType id="_116" name="char" size="8" align="8"/>
  <FundamentalType id="_118" name="void" size="0" align="8"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/bits/types.h"/>
  <File id="f2" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/bits/fcntl.h"/>
  <File id="f3" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/fcntl.h"/>
  <File id="f4" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/bits/types/struct_timespec.h"/>
  <File id="f5" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/bits/stat.h"/>
</CastXML>
