<?xml version="1.0"?>
<CastXML format="1.1.0">
  <Namespace id="_1" name="::" members="_2 _3 _4 _5 _6 _7 _8 _9 _10 _11 _12 _13 _14 _15 _16 _17 _18 _19 _20 _21 _22 _23 _24 _25 _26 _27 _28 _29 _30 _31 _32 _33 _34 _35 _36 _37 _38 _39 _40 _41 _42 _43 _44 _45 _46 _47 _48 _49 _50 _51 _52 _53 _54 _55 _56 _57 _58 _59 _60 _61 _62 _63 _64 _65 _66 _67 _68 _69 _70 _71 _72 _73 _74 _75 _76"/>
  <Typedef id="_2" name="__NSConstantString" type="_77" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_3" name="__builtin_va_list" type="_78" context="_1" location="f0:0" file="f0" line="0"/>
  <Typedef id="_4" name="__u_char" type="_79" context="_1" location="f1:30" file="f1" line="30"/>
  <Typedef id="_5" name="__u_short" type="_80" context="_1" location="f1:31" file="f1" line="31"/>
  <Typedef id="_6" name="__u_int" type="_81" context="_1" location="f1:32" file="f1" line="32"/>
  <Typedef id="_7" name="__u_long" type="_82" context="_1" location="f1:33" file="f1" line="33"/>
  <Typedef id="_8" name="__int8_t" type="_83" context="_1" location="f1:36" file="f1" line="36"/>
  <Typedef id="_9" name="__uint8_t" type="_79" context="_1" location="f1:37" file="f1" line="37"/>
  <Typedef id="_10" name="__int16_t" type="_84" context="_1" location="f1:38" file="f1" line="38"/>
  <Typedef id="_11" name="__uint16_t" type="_80" context="_1" location="f1:39" file="f1" line="39"/>
  <Typedef id="_12" name="__int32_t" type="_85" context="_1" location="f1:40" file="f1" line="40"/>
  <Typedef id="_13" name="__uint32_t" type="_81" context="_1" location="f1:41" file="f1" line="41"/>
  <Typedef id="_14" name="__int64_t" type="_86" context="_1" location="f1:46" file="f1" line="46"/>
  <Typedef id="_15" name="__uint64_t" type="_87" context="_1" location="f1:47" file="f1" line="47"/>
  <Typedef id="_16" name="__quad_t" type="_86" context="_1" location="f1:55" file="f1" line="55"/>
  <Typedef id="_17" name="__u_quad_t" type="_87" context="_1" location="f1:56" file="f1" line="56"/>
  <Typedef id="_18" name="__intmax_t" type="_86" context="_1" location="f1:64" file="f1" line="64"/>
  <Typedef id="_19" name="__uintmax_t" type="_87" context="_1" location="f1:65" file="f1" line="65"/>
  <Typedef id="_20" name="__dev_t" type="_17" context="_1" location="f1:133" file="f1" line="133"/>
  <Typedef id="_21" name="__uid_t" type="_81" context="_1" location="f1:134" file="f1" line="134"/>
  <Typedef id="_22" name="__gid_t" type="_81" context="_1" location="f1:135" file="f1" line="135"/>
  <Typedef id="_23" name="__ino_t" type="_82" context="_1" location="f1:136" file="f1" line="136"/>
  <Typedef id="_24" name="__ino64_t" type="_17" context="_1" location="f1:137" file="f1" line="137"/>
  <Typedef id="_25" name="__mode_t" type="_81" context="_1" location="f1:138" file="f1" line="138"/>
  <Typedef id="_26" name="__nlink_t" type="_81" context="_1" location="f1:139" file="f1" line="139"/>
  <Typedef id="_27" name="__off_t" type="_88" context="_1" location="f1:140" file="f1" line="140"/>
  <Typedef id="_28" name="__off64_t" type="_16" context="_1" location="f1:141" file="f1" line="141"/>
  <Typedef id="_29" name="__pid_t" type="_85" context="_1" location="f1:142" file="f1" line="142"/>
  <Struct id="_30" name="" context="_1" location="f1:143" file="f1" line="143" members="_89" size="64" align="32"/>
  <Typedef id="_31" name="__fsid_t" type="_90" context="_1" location="f1:143" file="f1" line="143"/>
  <Typedef id="_32" name="__clock_t" type="_88" context="_1" location="f1:144" file="f1" line="144"/>
  <Typedef id="_33" name="__rlim_t" type="_82" context="_1" location="f1:145" file="f1" line="145"/>
  <Typedef id="_34" name="__rlim64_t" type="_17" context="_1" location="f1:146" file="f1" line="146"/>
  <Typedef id="_35" name="__id_t" type="_81" context="_1" location="f1:147" file="f1" line="147"/>
  <Typedef id="_36" name="__time_t" type="_88" context="_1" location="f1:148" file="f1" line="148"/>
  <Typedef id="_37" name="__useconds_t" type="_81" context="_1" location="f1:149" file="f1" line="149"/>
  <Typedef id="_38" name="__suseconds_t" type="_88" context="_1" location="f1:150" file="f1" line="150"/>
  <Typedef id="_39" name="__daddr_t" type="_85" context="_1" location="f1:152" file="f1" line="152"/>
  <Typedef id="_40" name="__key_t" type="_85" context="_1" location="f1:153" file="f1" line="153"/>
  <Typedef id="_41" name="__clockid_t" type="_85" context="_1" location="f1:156" file="f1" line="156"/>
  <Typedef id="_42" name="__timer_t" type="_91" context="_1" location="f1:159" file="f1" line="159"/>
  <Typedef id="_43" name="__blksize_t" type="_88" context="_1" location="f1:162" file="f1" line="162"/>
  <Typedef id="_44" name="__blkcnt_t" type="_88" context="_1" location="f1:167" file="f1" line="167"/>
  <Typedef id="_45" name="__blkcnt64_t" type="_16" context="_1" location="f1:168" file="f1" line="168"/>
  <Typedef id="_46" name="__fsblkcnt_t" type="_82" context="_1" location="f1:171" file="f1" line="171"/>
  <Typedef id="_47" name="__fsblkcnt64_t" type="_17" context="_1" location="f1:172" file="f1" line="172"/>
  <Typedef id="_48" name="__fsfilcnt_t" type="_82" context="_1" location="f1:175" file="f1" line="175"/>
  <Typedef id="_49" name="__fsfilcnt64_t" type="_17" context="_1" location="f1:176" file="f1" line="176"/>
  <Typedef id="_50" name="__fsword_t" type="_85" context="_1" location="f1:179" file="f1" line="179"/>
  <Typedef id="_51" name="__ssize_t" type="_85" context="_1" location="f1:181" file="f1" line="181"/>
  <Typedef id="_52" name="__syscall_slong_t" type="_88" context="_1" location="f1:184" file="f1" line="184"/>
  <Typedef id="_53" name="__syscall_ulong_t" type="_82" context="_1" location="f1:186" file="f1" line="186"/>
  <Typedef id="_54" name="__loff_t" type="_28" context="_1" location="f1:190" file="f1" line="190"/>
  <Typedef id="_55" name="__caddr_t" type="_78" context="_1" location="f1:191" file="f1" line="191"/>
  <Typedef id="_56" name="__intptr_t" type="_85" context="_1" location="f1:194" file="f1" line="194"/>
  <Typedef id="_57" name="__socklen_t" type="_81" context="_1" location="f1:197" file="f1" line="197"/>
  <Typedef id="_58" name="__sig_atomic_t" type="_85" context="_1" location="f1:202" file="f1" line="202"/>
  <Typedef id="_59" name="pid_t" type="_29" context="_1" location="f2:30" file="f2" line="30"/>
  <Typedef id="_60" name="cc_t" type="_79" context="_1" location="f3:23" file="f3" line="23"/>
  <Typedef id="_61" name="speed_t" type="_81" context="_1" location="f3:24" file="f3" line="24"/>
  <Typedef id="_62" name="tcflag_t" type="_81" context="_1" location="f3:25" file="f3" line="25"/>
  <Struct id="_63" name="termios" context="_1" location="f3:28" file="f3" line="28" members="_92 _93 _94 _95 _96 _97 _98 _99" size="480" align="32"/>
  <Function id="_64" name="cfgetospeed" returns="_61" context="_1" location="f2:48" file="f2" line="48" extern="1" mangled="_Z11cfgetospeed">
    <Argument name="__termios_p" type="_100" location="f2:48" file="f2" line="48"/>
  </Function>
  <Function id="_65" name="cfgetispeed" returns="_61" context="_1" location="f2:51" file="f2" line="51" extern="1" mangled="_Z11cfgetispeed">
    <Argument name="__termios_p" type="_100" location="f2:51" file="f2" line="51"/>
  </Function>
  <Function id="_66" name="cfsetospeed" returns="_85" context="_1" location="f2:54" file="f2" line="54" extern="1" mangled="_Z11cfsetospeed">
    <Argument name="__termios_p" type="_101" location="f2:54" file="f2" line="54"/>
    <Argument name="__speed" type="_61" location="f2:54" file="f2" line="54"/>
  </Function>
  <Function id="_67" name="cfsetispeed" returns="_85" context="_1" location="f2:57" file="f2" line="57" extern="1" mangled="_Z11cfsetispeed">
    <Argument name="__termios_p" type="_101" location="f2:57" file="f2" line="57"/>
    <Argument name="__speed" type="_61" location="f2:57" file="f2" line="57"/>
  </Function>
  <Function id="_68" name="cfsetspeed" returns="_85" context="_1" location="f2:61" file="f2" line="61" extern="1" mangled="_Z10cfsetspeed">
    <Argument name="__termios_p" type="_101" location="f2:61" file="f2" line="61"/>
    <Argument name="__speed" type="_61" location="f2:61" file="f2" line="61"/>
  </Function>
  <Function id="_69" name="tcgetattr" returns="_85" context="_1" location="f2:66" file="f2" line="66" extern="1" mangled="_Z9tcgetattr">
    <Argument name="__fd" type="_85" location="f2:66" file="f2" line="66"/>
    <Argument name="__termios_p" type="_101" location="f2:66" file="f2" line="66"/>
  </Function>
  <Function id="_70" name="tcsetattr" returns="_85" context="_1" location="f2:70" file="f2" line="70" extern="1" mangled="_Z9tcsetattr">
    <Argument name="__fd" type="_85" location="f2:70" file="f2" line="70"/>
    <Argument name="__optional_actions" type="_85" location="f2:70" file="f2" line="70"/>
    <Argument name="__termios_p" type="_100" location="f2:71" file="f2" line="71"/>
  </Function>
  <Function id="_71" name="cfmakeraw" returns="_102" context="_1" location="f2:76" file="f2" line="76" extern="1" mangled="_Z9cfmakeraw">
    <Argument name="__termios_p" type="_101" location="f2:76" file="f2" line="76"/>
  </Function>
  <Function id="_72" name="tcsendbreak" returns="_85" context="_1" location="f2:80" file="f2" line="80" extern="1" mangled="_Z11tcsendbreak">
    <Argument name="__fd" type="_85" location="f2:80" file="f2" line="80"/>
    <Argument name="__duration" type="_85" location="f2:80" file="f2" line="80"/>
  </Function>
  <Function id="_73" name="tcdrain" returns="_85" context="_1" location="f2:86" file="f2" line="86" extern="1" mangled="_Z7tcdrain">
    <Argument name="__fd" type="_85" location="f2:86" file="f2" line="86"/>
  </Function>
  <Function id="_74" name="tcflush" returns="_85" context="_1" location="f2:90" file="f2" line="90" extern="1" mangled="_Z7tcflush">
    <Argument name="__fd" type="_85" location="f2:90" file="f2" line="90"/>
    <Argument name="__queue_selector" type="_85" location="f2:90" file="f2" line="90"/>
  </Function>
  <Function id="_75" name="tcflow" returns="_85" context="_1" location="f2:94" file="f2" line="94" extern="1" mangled="_Z6tcflow">
    <Argument name="__fd" type="_85" location="f2:94" file="f2" line="94"/>
    <Argument name="__action" type="_85" location="f2:94" file="f2" line="94"/>
  </Function>
  <Function id="_76" name="tcgetsid" returns="_29" context="_1" location="f2:99" file="f2" line="99" extern="1" mangled="_Z8tcgetsid">
    <Argument name="__fd" type="_85" location="f2:99" file="f2" line="99"/>
  </Function>
  <Struct id="_77" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_103 _104 _105 _106" size="128" align="32"/>
  <PointerType id="_78" type="_107" size="32" align="32"/>
  <FundamentalType id="_79" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_80" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_81" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_82" name="long unsigned int" size="32" align="32"/>
  <FundamentalType id="_83" name="signed char" size="8" align="8"/>
  <FundamentalType id="_84" name="short int" size="16" align="16"/>
  <FundamentalType id="_85" name="int" size="32" align="32"/>
  <FundamentalType id="_86" name="long long int" size="64" align="32"/>
  <FundamentalType id="_87" name="long long unsigned int" size="64" align="32"/>
  <FundamentalType id="_88" name="long int" size="32" align="32"/>
  <Field id="_89" name="__val" type="_108" context="_30" access="public" location="f1:143" file="f1" line="143" offset="0"/>
  <ElaboratedType id="_90" type="_30"/>
  <PointerType id="_91" type="_102" size="32" align="32"/>
  <Field id="_92" name="c_iflag" type="_62" context="_63" access="public" location="f3:30" file="f3" line="30" offset="0"/>
  <Field id="_93" name="c_oflag" type="_62" context="_63" access="public" location="f3:31" file="f3" line="31" offset="32"/>
  <Field id="_94" name="c_cflag" type="_62" context="_63" access="public" location="f3:32" file="f3" line="32" offset="64"/>
  <Field id="_95" name="c_lflag" type="_62" context="_63" access="public" location="f3:33" file="f3" line="33" offset="96"/>
  <Field id="_96" name="c_line" type="_60" context="_63" access="public" location="f3:34" file="f3" line="34" offset="128"/>
  <Field id="_97" name="c_cc" type="_109" context="_63" access="public" location="f3:35" file="f3" line="35" offset="136"/>
  <Field id="_98" name="c_ispeed" type="_61" context="_63" access="public" location="f3:36" file="f3" line="36" offset="416"/>
  <Field id="_99" name="c_ospeed" type="_61" context="_63" access="public" location="f3:37" file="f3" line="37" offset="448"/>
  <PointerType id="_100" type="_110c" size="32" align="32"/>
  <PointerType id="_101" type="_110" size="32" align="32"/>
  <FundamentalType id="_102" name="void" size="0" align="8"/>
  <Field id="_103" name="isa" type="_111" context="_77" access="public" offset="0"/>
  <Field id="_104" name="flags" type="_85" context="_77" access="public" offset="32"/>
  <Field id="_105" name="str" type="_112" context="_77" access="public" offset="64"/>
  <Field id="_106" name="length" type="_88" context="_77" access="public" offset="96"/>
  <ArrayType id="_108" min="0" max="1" type="_85"/>
  <ArrayType id="_109" min="0" max="31" type="_60"/>
  <CvQualifiedType id="_110c" type="_110" const="1"/>
  <PointerType id="_111" type="_85c" size="32" align="32"/>
  <CvQualifiedType id="_85c" type="_85" const="1"/>
  <PointerType id="_112" type="_107c" size="32" align="32"/>
  <CvQualifiedType id="_107c" type="_107" const="1"/>
  <FundamentalType id="_107" name="char" size="8" align="8"/>
  <ElaboratedType id="_110" type="_63"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/bits/types.h"/>
  <File id="f2" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/termios.h"/>
  <File id="f3" name="/usr/lib/gcc-cross/i686-linux-gnu/8/../../../../i686-linux-gnu/include/bits/termios.h"/>
</CastXML>
